# 实习三：非关系数据库
> 成员：罗逸龙2000017781  占可盈2000013136  范居令2000012942

## 第一题：窗口函数实现Alpha101量化因子

In [8]:
import tushare as ts
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## set this to your tushare token
TUSHARE_TOKEN = "bd64f388adebe21dd43ab0d399352666593a145bdc6b92abcae33b3b"
ts.set_token(TUSHARE_TOKEN)
pro = ts.pro_api()

data = pro.daily(ts_code='600019.SH', start_date='20110101', end_date='20230101')

print(len(data))
print(data.head())

2818
     ts_code trade_date  open  high   low  close  pre_close  change  pct_chg
0  600019.SH   20221230  5.65  5.65  5.57   5.59       5.60   -0.01  -0.1786  \
1  600019.SH   20221229  5.60  5.66  5.56   5.60       5.63   -0.03  -0.5329
2  600019.SH   20221228  5.65  5.68  5.60   5.63       5.60    0.03   0.5357
3  600019.SH   20221227  5.56  5.67  5.55   5.60       5.54    0.06   1.0830
4  600019.SH   20221226  5.64  5.64  5.51   5.54       5.66   -0.12  -2.1201

         vol      amount
0  226293.75  126690.768
1  235643.27  132153.801
2  318845.36  179787.366
3  329442.13  185118.785
4  366420.07  203221.327

In [39]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [40]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu2000013136:stu2000013136@162.105.146.37:43306

In [41]:
%sql use stu2000013136

 * mysql://stu2000013136:***@162.105.146.37:43306
0 rows affected.

[]

In [11]:
%%sql
CREATE TABLE `tushare` 
(
    `id` BIGINT UNSIGNED NOT NULL AUTO_INCREMENT, 
    `ts_code` VARCHAR(255) NOT NULL,
    `trade_date` VARCHAR(255) NOT NULL COMMENT 'date as YYYYMMDD',
    `open` DECIMAL(38, 10) NOT NULL,
    `high` DECIMAL(38, 10) NOT NULL,
    `low` DECIMAL(38, 10) NOT NULL,
    `close` DECIMAL(38, 10) NOT NULL,
    `pre_close` DECIMAL(38, 10) NOT NULL,
    `change` DECIMAL(38, 10) NOT NULL,
    `pct_chg` DECIMAL(38, 10) NOT NULL,
    `vol` DECIMAL(38, 10) NOT NULL,
    `amount` DECIMAL(38, 10) NOT NULL,
    PRIMARY KEY (`id`)
)ENGINE=InnoDB;

 * mysql://stu2000013136:***@162.105.146.37:43306
0 rows affected.

[]

In [52]:
STUDENTID = 'stu2000013136'
db = pymysql.connect(host='162.105.146.37',user=STUDENTID, password=STUDENTID, port=43306, db=STUDENTID)
cursor = db.cursor()

In [25]:
# load data to sql
data_list = np.array(data, dtype=str).tolist()
print(data_list[0])

tablename = "tushare"
key_list = "ts_code, trade_date, open, high, low, close, pre_close, change, pct_chg, vol, amount" 
insert_sql = "INSERT INTO `tushare`\
(`ts_code`, `trade_date`, `open`, `high`, `low`, `close`, `pre_close`, `change`, `pct_chg`, `vol`, `amount`) VALUES\
(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)"
count = 0
for i in data_list:
    cursor.execute(insert_sql, i)
    count += 1

if count == len(data_list):
    db.commit()
else:
    db.rollback()
    print(count, len(data_list))

['600019.SH', '20221230', '5.65', '5.65', '5.57', '5.59', '5.6', '-0.01', '-0.1786', '226293.75', '126690.768']

In [42]:
%%sql
SELECT COUNT(*) FROM `tushare`;
SELECT * FROM `tushare` LIMIT 5;

 * mysql://stu2000013136:***@162.105.146.37:43306
1 rows affected.
5 rows affected.

[(1, '600019.SH', '20221230', Decimal('5.6500000000'), Decimal('5.6500000000'), Decimal('5.5700000000'), Decimal('5.5900000000'), Decimal('5.6000000000'), Decimal('-0.0100000000'), Decimal('-0.1786000000'), Decimal('226293.7500000000'), Decimal('126690.7680000000')),
 (2, '600019.SH', '20221229', Decimal('5.6000000000'), Decimal('5.6600000000'), Decimal('5.5600000000'), Decimal('5.6000000000'), Decimal('5.6300000000'), Decimal('-0.0300000000'), Decimal('-0.5329000000'), Decimal('235643.2700000000'), Decimal('132153.8010000000')),
 (3, '600019.SH', '20221228', Decimal('5.6500000000'), Decimal('5.6800000000'), Decimal('5.6000000000'), Decimal('5.6300000000'), Decimal('5.6000000000'), Decimal('0.0300000000'), Decimal('0.5357000000'), Decimal('318845.3600000000'), Decimal('179787.3660000000')),
 (4, '600019.SH', '20221227', Decimal('5.5600000000'), Decimal('5.6700000000'), Decimal('5.5500000000'), Decimal('5.6000000000'), Decimal('5.5400000000'), Decimal('0.0600000000'), Decimal('1.0830000000'), Decimal('329442.1300000000'), Decimal('185118.7850000000')),
 (5, '600019.SH', '20221226', Decimal('5.6400000000'), Decimal('5.6400000000'), Decimal('5.5100000000'), Decimal('5.5400000000'), Decimal('5.6600000000'), Decimal('-0.1200000000'), Decimal('-2.1201000000'), Decimal('366420.0700000000'), Decimal('203221.3270000000'))]

### Alpha006
$$
\begin{aligned}
\Alpha_{006} =  -1 \times \text{correlation}(\text{open}, \text{volume}, 10)
\end{aligned}
$$

In [114]:
%sql SELECT VERSION();

 * mysql://stu2000013136:***@162.105.146.37:43306
1 rows affected.

[('8.0.23',)]

In [116]:
%%sql
SELECT
    t2.ts_code,
    t2.trade_date,
    -1 * (t2.top / SQRT(t2.bottom_1 * t2.bottom_2)) AS `alpha006`
FROM (
    SELECT
        t1.ts_code,
        t1.trade_date,
        SUM((t1.open - t1.open_avg) * (t1.vol - t1.vol_avg))
            OVER (PARTITION BY t1.ts_code ORDER BY t1.trade_date ROWS BETWEEN 9 PRECEDING AND CURRENT ROW) AS `top`,
        SUM(POWER(t1.open - t1.open_avg, 2))
            OVER (PARTITION BY t1.ts_code ORDER BY t1.trade_date ROWS BETWEEN 9 PRECEDING AND CURRENT ROW) AS `bottom_1`,
        SUM(POWER(t1.vol - t1.vol_avg, 2))
            OVER (PARTITION BY t1.ts_code ORDER BY t1.trade_date ROWS BETWEEN 9 PRECEDING AND CURRENT ROW) AS `bottom_2`
    FROM (
        SELECT
            `ts_code`,
            `trade_date`,
            `open`,
            `vol`,
            AVG(`open`) OVER (PARTITION BY `ts_code` ORDER BY `trade_date` ROWS BETWEEN 9 PRECEDING AND CURRENT ROW) AS `open_avg`,
            AVG(`vol`) OVER (PARTITION BY `ts_code` ORDER BY `trade_date` ROWS BETWEEN 9 PRECEDING AND CURRENT ROW) AS `vol_avg`
        FROM `tushare`
        ORDER BY 
            ts_code,
            trade_date
    ) AS t1
    ORDER BY
        t1.ts_code,
        t1.trade_date
) AS t2
ORDER BY
    t2.ts_code,
    t2.trade_date
LIMIT 10
OFFSET 10;

 * mysql://stu2000013136:***@162.105.146.37:43306
10 rows affected.

[('600019.SH', '20110118', -0.3372089258553294),
 ('600019.SH', '20110119', -0.38321917708764336),
 ('600019.SH', '20110120', -0.40513021319889886),
 ('600019.SH', '20110121', -0.39330202483123133),
 ('600019.SH', '20110124', -0.39106198462867675),
 ('600019.SH', '20110125', -0.2427751656934018),
 ('600019.SH', '20110126', -0.12083796897207222),
 ('600019.SH', '20110127', -0.19168944610490982),
 ('600019.SH', '20110128', -0.06725795577958275),
 ('600019.SH', '20110131', -0.01866068498198014)]

### Alpha023
$$
\begin{aligned}
\Alpha_{023} = \Big((\sum(\text{high}, 20) / 20) < \text{high}\Big) ? \Big(-1 \times \delta(\text{high}, 2)\Big) : 0
\end{aligned}
$$

In [127]:
%%sql

SELECT
    t1.ts_code,
    t1.trade_date,
    CASE
        WHEN (t1.sum / 20) < t1.high
        THEN t1.true
        ELSE 0
    END AS `alpha023`
FROM (
    SELECT
        ts_code,
        trade_date,
        high,
        SUM(`high`) OVER (PARTITION BY ts_code ORDER BY trade_date ROWS BETWEEN 19 PRECEDING AND CURRENT ROW) AS `sum`,
        high - LAG(high, 2) OVER (ORDER BY trade_date) AS `true`
    FROM `tushare`
) AS t1
ORDER BY
    t1.ts_code,
    t1.trade_date
LIMIT 10
OFFSET 20;

 * mysql://stu2000013136:***@162.105.146.37:43306
10 rows affected.

[('600019.SH', '20110201', Decimal('0.0800000000')),
 ('600019.SH', '20110209', Decimal('-0.1000000000')),
 ('600019.SH', '20110210', Decimal('-0.0200000000')),
 ('600019.SH', '20110211', Decimal('0.2100000000')),
 ('600019.SH', '20110214', Decimal('0.4100000000')),
 ('600019.SH', '20110215', Decimal('0.2400000000')),
 ('600019.SH', '20110216', Decimal('0.1000000000')),
 ('600019.SH', '20110217', Decimal('0.1200000000')),
 ('600019.SH', '20110218', Decimal('-0.0700000000')),
 ('600019.SH', '20110221', Decimal('-0.1500000000'))]

### Alpha041
$$
\begin{aligned}
\Alpha_{041} =  ((\text{high} \times \text{low})^{0.5}) - \text{vwap}
\end{aligned}
$$

In [139]:
%%sql
SELECT 
    t1.ts_code,
    t1.trade_date,
    SQRT(t1.high * t1.low) - (t1.vwap_top / t1.vwap_bottom) AS 'alpha041'
FROM (
    SELECT
        ts_code,
        trade_date,
        high,
        low,
        SUM(`close` * `vol`) OVER (PARTITION BY trade_date) AS `vwap_top`,
        SUM(`vol`) OVER (PARTITION BY trade_date) AS `vwap_bottom`
    FROM `tushare`
    ORDER BY
        ts_code,
        trade_date
) AS t1
ORDER BY
    t1.ts_code,
    t1.trade_date
LIMIT 10;

 * mysql://stu2000013136:***@162.105.146.37:43306
10 rows affected.

[('600019.SH', '20110104', -0.11621417826176028),
 ('600019.SH', '20110105', 0.009876159803684281),
 ('600019.SH', '20110106', -0.015234682317749382),
 ('600019.SH', '20110107', -0.01639243230463805),
 ('600019.SH', '20110110', 0.05467869937383352),
 ('600019.SH', '20110111', -0.08583338583007905),
 ('600019.SH', '20110112', -0.045974646273792),
 ('600019.SH', '20110113', 0.0444698986788401),
 ('600019.SH', '20110114', -0.020478342960537077),
 ('600019.SH', '20110117', 0.07872151024689433)]

### Alpha053
$$
\begin{aligned}
\Alpha_{053} =  -1 * \delta\Big(\big(((\text{close} - \text{low}) - (\text{high} - \text{close})) / (\text{close} - \text{low})\big), 9\Big)
\end{aligned}
$$

In [149]:
%%sql
SELECT 
    t1.ts_code,
    t1.trade_date,
    t1.x - LAG(t1.x, 9) OVER (ORDER BY t1.trade_date) AS `alpha053`
FROM (
    SELECT
        ts_code,
        trade_date,
        ((`close` - `low`) - (`high` - `close`)) / (`close` - `low`) AS `x`
    FROM `tushare`
    ORDER BY
        ts_code,
        trade_date
) AS t1
ORDER BY
    t1.ts_code,
    t1.trade_date
LIMIT 10
OFFSET 10;

 * mysql://stu2000013136:***@162.105.146.37:43306
10 rows affected.

[('600019.SH', '20110118', Decimal('1.29166666666667')),
 ('600019.SH', '20110119', Decimal('0.48051948051948')),
 ('600019.SH', '20110120', Decimal('-8.20000000000000')),
 ('600019.SH', '20110121', Decimal('11.45000000000000')),
 ('600019.SH', '20110124', Decimal('-1.22807017543859')),
 ('600019.SH', '20110125', Decimal('-1.48557692307692')),
 ('600019.SH', '20110126', Decimal('3.10714285714286')),
 ('600019.SH', '20110127', Decimal('0.24705882352941')),
 ('600019.SH', '20110128', Decimal('2.70000000000000')),
 ('600019.SH', '20110131', Decimal('-0.20833333333333'))]

### Alpha101
$$
\begin{aligned}
\Alpha_{101} =  (\text{close} - \text{open}) / (\text{high} - \text{low} + 0.001)
\end{aligned}
$$

In [150]:
%%sql
SELECT 
    ts_code,
    trade_date,
    (close - open) / (high - low + 0.001) AS 'alpha101'
FROM `tushare`
ORDER BY
        ts_code,
        trade_date
LIMIT 10;

 * mysql://stu2000013136:***@162.105.146.37:43306
10 rows affected.

[('600019.SH', '20110104', Decimal('0.43824701195219')),
 ('600019.SH', '20110105', Decimal('-0.49382716049383')),
 ('600019.SH', '20110106', Decimal('0E-14')),
 ('600019.SH', '20110107', Decimal('0.36900369003690')),
 ('600019.SH', '20110110', Decimal('-0.15267175572519')),
 ('600019.SH', '20110111', Decimal('0.85308056872038')),
 ('600019.SH', '20110112', Decimal('0.47619047619048')),
 ('600019.SH', '20110113', Decimal('-0.58479532163743')),
 ('600019.SH', '20110114', Decimal('-0.37267080745342')),
 ('600019.SH', '20110117', Decimal('-0.42145593869732'))]